app/Controllers/admin.php

    public function log()
    {
        $session = session();
        $username = $this->request->getpost('uname');
        $pass = $this->request->getpost('pass');

        $db      = \Config\Database::connect();
        $query = $db->table('user')->where(['username' => $username, 'password' => md5($pass)])->get();
---
SELECT *
FROM `user`
WHERE `username` IS NULL
AND `password` = 'd41d8cd98f00b204e9800998ecf8427e'