app/Models/Models.php

INSERT INTO `visitor` (`visitor_nama`, `visitor_instagram`, `visitor_paket`, `visitor_estimasi`, `visitor_budget`, `visitor_q1`, `visitor_q2`) VALUES ('asas', 'adas', 'Akad Only', 'asd', '< 5 Juta', 'Instagram', 'dasd')
---
    public function vis($s){
        $this->db->table('visitor')->insert($s);